#+TITLE: Finding Your (In)voice
#+AUTHOR: Bala Ramadurai
Youtube Video of the emacs conference 2021 talk - https://youtu.be/P3EMosDPobs
*** Clock Table for Reference                                                                              :noexport:
#+BEGIN: clocktable :scope file :match "+Billable+ACMEClient1" :maxlevel 3 :block lastmonth :compact t :emphasize nil :header "#+NAME: clocktable-lastmonth-06-11-2021\n" :formula "$3=$2;t"
#+NAME: clocktable-lastmonth-06-11-2021
| Headline                           | Time |      |
|------------------------------------+------+------|
| *Total time*                         | *1:00* | 1.00 |
|------------------------------------+------+------|
| Teaching 2021 ACMEClient1 MBA 1 DT | 1:00 | 1.00 |
#+TBLFM: $3=$2;t
#+END

*** Items

#+begin_SRC python :results output raw :var clockdata=clocktable-lastmonth-06-11-2021 items=Item-Master-ACMEClient1 :exports results
import os, sys, itertools, pandas as pd
from tabulate import tabulate

CurrencySymbol = 'INR'; 

timesheetdf = pd.DataFrame(columns=['Item', 'Quantity', 'HSN', 'Rate', 'GSTRate', 'Taxable', 'Total GST', 'Total'])
itemsdf = pd.DataFrame(items, columns=['Item', 'HSN', 'Rate', 'GSTRate'])
clockdata_lines = clockdata[2:] # Change this index according to the depth of the headline

for row in clockdata_lines:
    name = row[0].replace('\_','').strip()
    item, quantity, hsn, rate, gstrate, taxable, gst, total = '', 0, '',0,0,0,0,0
    subitem = name
    if row[2] != '':
        quantity = float(row[2])
        item = name
        subitem = ''
        loc = itemsdf[itemsdf.Item == name]
        if len(loc) > 0:
            hsn = int(loc.HSN)
            rate = float(loc.Rate)
            gstrate = float(loc.GSTRate)
        taxable = round(quantity * rate, 2)
        gst = round(gstrate * taxable/100, 2)
        total = round(taxable + gst, 2)
    timesheetdf.loc[len(timesheetdf)] = [item, quantity, hsn, rate, gstrate, taxable, gst, total]

totaltaxable = pd.to_numeric(timesheetdf.Taxable, errors='coerce').sum()
totalgst = pd.to_numeric(timesheetdf['Total GST'], errors='coerce').sum()
amountdue = pd.to_numeric(timesheetdf.Total, errors='coerce').sum()
print("#+ATTR_LATEX: :environment tabular :align a{4.25cm}p{1.25cm}a{1.5cm}p{1cm}a{1.25cm}p{1.25cm}a{1.15cm}p{1.35cm}")
print('#+NAME: tab-items-06-11-2021')
header_list = [' *Item*', '*Quantity*', '*HSN/SAC*', '*Rate(' + CurrencySymbol + ')*', '*GST(%)*', '*Taxable Value(' + CurrencySymbol + ')*', '*' + '*GST*' + ' (' + CurrencySymbol + ')*', '*Total(' + CurrencySymbol + ')* ']
footer_list = [' *Total* ', ' ', ' ', ' ', ' ', totaltaxable, totalgst, amountdue]
timesheetdf.loc[len(timesheetdf)] = footer_list
print(tabulate(timesheetdf, header_list, tablefmt="orgtbl", floatfmt=".2f",showindex=False))
#+end_SRC

#+RESULTS:
#+ATTR_LATEX: :environment tabular :align a{4.25cm}p{1.25cm}a{1.5cm}p{1cm}a{1.25cm}p{1.25cm}a{1.15cm}p{1.35cm}
#+NAME: tab-items-06-11-2021
| *Item*                               | *Quantity* | *HSN/SAC* | *Rate(INR)* | *GST(%)* | *Taxable Value(INR)* | **GST* (INR)* | *Total(INR)* |
|------------------------------------+----------+---------+-----------+--------+--------------------+-------------+------------|
| Teaching 2021 ACMEClient1 MBA 1 DT |      1.0 |  998393 |     100.0 |   18.0 |             100.00 |       18.00 |     118.00 |
| *Total*                              |          |         |           |        |             100.00 |       18.00 |     118.00 |

#+BEGIN_SRC python :results output raw :exports results :var taxable=tab-items-06-11-2021[-1,5] amountdue=tab-items-06-11-2021[-1,7] gst=tab-items-06-11-2021[-1,6]
from num2words import num2words
CurrencySymbol = 'INR '
CurrencyWords = 'Rupees'
tableofvalues = " | /Taxable Value/ | *" + CurrencySymbol + str(taxable) + "* |\n | /Total amount due/ | *" + CurrencySymbol + str(amountdue) + "* |\n | | " + CurrencyWords + " *" + num2words(amountdue, lang='en_IN') + "* Only |"
print("#+ATTR_LATEX: :environment tabular :align la{8cm}")
print(tableofvalues)
print('# evaluate this and use =C-c C-v += or M-x org-babel-tangle-append or =,bA= ')
print('#+BEGIN_SRC beancount :exports none :tangle ~/org/Fava/fin-data/finance.org\n' )
print(',**** ACMEClient1 Invoice 2021-12-06')
print('2021-12-06 * "ACMEClient1 Invoice" #tax-2020-21')
print('  Income:ACMEClient1                   -' + str(taxable) + CurrencySymbol)
print('  Equity:Taxes:IncomeTax                           ' + str(round(taxable*0.1,2)) + CurrencySymbol)
print('  Equity:Taxes:CGST:Payable                          -' + str(round(gst/2,2)) + CurrencySymbol)
print('  Equity:Taxes:SGST:Payable                          -' + str(round(gst/2,2)) + CurrencySymbol)
print('  Expenses:Others                                    0.00 INR')
print('  Assets:Liquid:AcmeBank:Current')
print('  Assets:AccountsReceivable               -' + str(round(taxable-taxable*0.1+gst,2)) + CurrencySymbol)
print('  Equity:TempAccount                            ' + str(round(taxable-taxable*0.1+gst,2)) + CurrencySymbol)
print(' ')
print('2021-11-06 * "ACMEClient1 Invoice Generated" #tax-2020-21')
print('  Equity:Taxes:CGST:Payable                           ' + str(round(gst/2,2)) + CurrencySymbol)
print('  Equity:Taxes:SGST:Payable                           ' + str(round(gst/2,2)) + CurrencySymbol)
print('  Equity:Taxes:CGST:Paid                             -' + str(round(gst/2,2)) + CurrencySymbol)
print('  Equity:Taxes:SGST:Paid                             -' + str(round(gst/2,2)) + CurrencySymbol)
print('  Assets:AccountsReceivable                ' + str(round(taxable-taxable*0.1+gst,2)) + CurrencySymbol)
print('  Equity:TempAccount                           -' + str(round(taxable-taxable*0.1+gst,2)) + CurrencySymbol)
print('#+END_SRC')
#+END_SRC

#+RESULTS:
#+ATTR_LATEX: :environment tabular :align la{8cm}
 | /Taxable Value/ | *INR 100.0* |
 | /Total amount due/ | *INR 118.0* |
 | | Rupees *one hundred and eighteen* Only |
# evaluate this and use =C-c C-v += or M-x org-babel-tangle-append or =,bA= 
#+BEGIN_SRC beancount :exports none :tangle ~/org/Fava/fin-data/finance.org

,**** ACMEClient1 Invoice 2021-12-06
2021-12-06 * "ACMEClient1 Invoice" #tax-2020-21
  Income:ACMEClient1                   -100.0INR 
  Equity:Taxes:IncomeTax                           10.0INR 
  Equity:Taxes:CGST:Payable                          -9.0INR 
  Equity:Taxes:SGST:Payable                          -9.0INR 
  Expenses:Others                                    0.00 INR
  Assets:Liquid:AcmeBank:Current
  Assets:AccountsReceivable               -108.0INR 
  Equity:TempAccount                            108.0INR 
 
2021-11-06 * "ACMEClient1 Invoice Generated" #tax-2020-21
  Equity:Taxes:CGST:Payable                           9.0INR 
  Equity:Taxes:SGST:Payable                           9.0INR 
  Equity:Taxes:CGST:Paid                             -9.0INR 
  Equity:Taxes:SGST:Paid                             -9.0INR 
  Assets:AccountsReceivable                108.0INR 
  Equity:TempAccount                           -108.0INR 
#+END_SRC

#+INCLUDE: setup/bankinfo.org::#bank
#+INCLUDE: setup/bankinfo.org::#terms

* TODO Teaching 2021 ACMEClient1 MBA 1 DT                                                         :Billable:ACMEClient1:
:LOGBOOK:
CLOCK: [2021-10-06 Wed 16:27]--[2021-10-06 Wed 17:27] =>  1:00
:END:

